### Pandas：数据分析处理库

In [7]:
import pandas as pd
df = pd.read_csv(r'D:\01_Arbeit\02_Studierung\13 数字化学习\01 网课\01 学习笔记\02 Python基础\01 py_file\data\train.csv')

.head()可以读取前几条数据，指定前几条都行

In [14]:
df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

.info返回当前的信息

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [17]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [18]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [19]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [20]:
df.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

自己创建一个DataFrame结构

In [21]:
data = {'country': ['aaa', 'bbb', 'ccc'],
       'population': [10, 12, 14]}
df_data = pd.DataFrame(data)
df_data

  country  population
0     aaa          10
1     bbb          12
2     ccc          14

In [24]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     3 non-null      object
 1   population  3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

取指定的数据

In [26]:
age = df['Age']
age[:5]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

series: dataframe中的一行/列

In [27]:
age.index

RangeIndex(start=0, stop=891, step=1)

In [28]:
age.values[:5]

array([22., 38., 26., 35., 35.])

In [29]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

索引我们可以自己指定

In [30]:
df = df.set_index('Name')
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
df['Age'][:5]

Name
Braund, Mr. Owen Harris                                22.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    38.0
Heikkinen, Miss. Laina                                 26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           35.0
Allen, Mr. William Henry                               35.0
Name: Age, dtype: float64

In [41]:
age = df['Age']
age

Name
Braund, Mr. Owen Harris                                22.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    38.0
Heikkinen, Miss. Laina                                 26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           35.0
Allen, Mr. William Henry                               35.0
                                                       ...
Montvila, Rev. Juozas                                  27.0
Graham, Miss. Margaret Edith                           19.0
Johnston, Miss. Catherine Helen "Carrie"                NaN
Behr, Mr. Karl Howell                                  26.0
Dooley, Mr. Patrick                                    32.0
Name: Age, Length: 891, dtype: float64

In [42]:
age['Allen, Mr. William Henry']

35.0

In [43]:
age[:5]

Name
Braund, Mr. Owen Harris                                22.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    38.0
Heikkinen, Miss. Laina                                 26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           35.0
Allen, Mr. William Henry                               35.0
Name: Age, dtype: float64

In [44]:
age.mean()

29.69911764705882

In [45]:
age.max()

80.0

In [46]:
age.min()

0.42

.describe()可以得到数据的基本统计特性

In [47]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### Pandas索引结构

In [52]:
df[['Age', 'Fare']][:5]

                                                     Age     Fare
Name
Braund, Mr. Owen Harris                             22.0   7.2500
Cumings, Mrs. John Bradley (Florence Briggs Tha...  38.0  71.2833
Heikkinen, Miss. Laina                              26.0   7.9250
Futrelle, Mrs. Jacques Heath (Lily May Peel)        35.0  53.1000
Allen, Mr. William Henry                            35.0   8.0500

* loc 用label去定位
* iloc 用position去定位

In [53]:
df.iloc[0]

PassengerId            1
Survived               0
Pclass                 3
Sex                 male
Age                   22
SibSp                  1
Parch                  0
Ticket         A/5 21171
Fare                7.25
Cabin                NaN
Embarked               S
Name: Braund, Mr. Owen Harris, dtype: object

In [54]:
df.iloc[:5]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [55]:
df.iloc[:5, 1:3]

                                                    Survived  Pclass
Name
Braund, Mr. Owen Harris                                    0       3
Cumings, Mrs. John Bradley (Florence Briggs Tha...         1       1
Heikkinen, Miss. Laina                                     1       3
Futrelle, Mrs. Jacques Heath (Lily May Peel)               1       1
Allen, Mr. William Henry                                   0       3

In [58]:
df.loc['Heikkinen, Miss. Laina']

PassengerId                   3
Survived                      1
Pclass                        3
Sex                      female
Age                          26
SibSp                         0
Parch                         0
Ticket         STON/O2. 3101282
Fare                      7.925
Cabin                       NaN
Embarked                      S
Name: Heikkinen, Miss. Laina, dtype: object

In [59]:
df.loc['Heikkinen, Miss. Laina', 'Fare']

7.925

In [60]:
df.loc['Heikkinen, Miss. Laina' : 'Allen, Mr. William Henry', :]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.100,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.050,NaN,S

In [61]:
df.loc['Heikkinen, Miss. Laina', 'Fare'] = 1000
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,1000.0000,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

### bool类型的索引

In [63]:
df['Fare'] > 40

Name
Braund, Mr. Owen Harris                                False
Cumings, Mrs. John Bradley (Florence Briggs Thayer)     True
Heikkinen, Miss. Laina                                  True
Futrelle, Mrs. Jacques Heath (Lily May Peel)            True
Allen, Mr. William Henry                               False
                                                       ...
Montvila, Rev. Juozas                                  False
Graham, Miss. Margaret Edith                           False
Johnston, Miss. Catherine Helen "Carrie"               False
Behr, Mr. Karl Howell                                  False
Dooley, Mr. Patrick                                    False
Name: Fare, Length: 891, dtype: bool

In [65]:
df[df['Fare'] > 40][:5]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,1000.0000,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"McCarthy, Mr. Timothy J",7,0,1,male,54.0,0,0,17463,51.8625,E46,S
"Fortune, Mr. Charles Alexander",28,0,1,male,19.0,3,2,19950,263.0000,C23 C25 C27,S

In [66]:
df[df['Sex'] == 'male'][:5]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",6,0,3,male,NaN,0,0,330877,8.4583,NaN,Q
"McCarthy, Mr. Timothy J",7,0,1,male,54.0,0,0,17463,51.8625,E46,S
"Palsson, Master. Gosta Leonard",8,0,3,male,2.0,3,1,349909,21.0750,NaN,S

In [67]:
df.loc[df['Sex'] == 'male', 'Age'].mean()

30.72664459161148

In [68]:
(df['Age'] > 70).sum()

5

In [70]:
import numpy as np
s = pd.Series(np.arange(5), index = np.arange(5)[::-1], dtype='int64')
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [72]:
s.isin([1,3,4])

4    False
3     True
2    False
1     True
0     True
dtype: bool

In [73]:
s[s.isin([1,3,4])]

3    1
1    3
0    4
dtype: int64

In [75]:
s2 = pd.Series(np.arange(6), index = pd.MultiIndex.from_product([[0,1],['a', 'b', 'c']]))
s2

0  a    0
   b    1
   c    2
1  a    3
   b    4
   c    5
dtype: int32

In [77]:
s2.iloc[s2.index.isin([(1, 'a'), (0, 'b')])]

0  b    1
1  a    3
dtype: int32

In [78]:
s[s>2]

1    3
0    4
dtype: int64

In [83]:
dates= pd.date_range('20201104', periods=8)
df = pd.DataFrame(np.random.randn(8,4), index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2020-11-04  0.378733  0.843744  0.791833 -0.662678
2020-11-05  0.046361  0.570352 -0.074747 -2.083560
2020-11-06 -1.496478  1.313202  0.710958  1.776408
2020-11-07  0.278067  0.442749 -1.572496 -1.899195
2020-11-08  1.199782 -1.907627  1.292967 -0.077650
2020-11-09 -0.338020  0.449067  0.599571  0.638228
2020-11-10  0.088581 -0.972801 -0.529128  0.110280
2020-11-11 -0.960695  0.078441 -0.294358  1.180643

In [85]:
df.where(df < 0)

                   A         B         C         D
2020-11-04       NaN       NaN       NaN -0.662678
2020-11-05       NaN       NaN -0.074747 -2.083560
2020-11-06 -1.496478       NaN       NaN       NaN
2020-11-07       NaN       NaN -1.572496 -1.899195
2020-11-08       NaN -1.907627       NaN -0.077650
2020-11-09 -0.338020       NaN       NaN       NaN
2020-11-10       NaN -0.972801 -0.529128       NaN
2020-11-11 -0.960695       NaN -0.294358       NaN

In [87]:
df.where(df < 0, 999)

                     A           B           C           D
2020-11-04  999.000000  999.000000  999.000000   -0.662678
2020-11-05  999.000000  999.000000   -0.074747   -2.083560
2020-11-06   -1.496478  999.000000  999.000000  999.000000
2020-11-07  999.000000  999.000000   -1.572496   -1.899195
2020-11-08  999.000000   -1.907627  999.000000   -0.077650
2020-11-09   -0.338020  999.000000  999.000000  999.000000
2020-11-10  999.000000   -0.972801   -0.529128  999.000000
2020-11-11   -0.960695  999.000000   -0.294358  999.000000

In [89]:
df = pd.DataFrame(np.random.rand(10, 3), columns = list('abc'))
df

          a         b         c
0  0.763784  0.672928  0.375887
1  0.204290  0.441376  0.161134
2  0.953623  0.507109  0.026006
3  0.959353  0.768853  0.245162
4  0.466086  0.484307  0.228165
5  0.710430  0.714333  0.974463
6  0.921765  0.042615  0.005457
7  0.582637  0.903945  0.945026
8  0.173685  0.068578  0.847763
9  0.963097  0.088330  0.091969

In [90]:
df.query('(a<b)')

          a         b         c
1  0.204290  0.441376  0.161134
4  0.466086  0.484307  0.228165
5  0.710430  0.714333  0.974463
7  0.582637  0.903945  0.945026

In [91]:
df.query('(a<b) & (b<c)')

          a         b         c
5  0.710430  0.714333  0.974463
7  0.582637  0.903945  0.945026

In [94]:
import pandas as pd
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
                  'data': [0,5,10,5,10,15,10,15,20]})
df

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

In [95]:
for key in ['A', 'B', 'C']:
    print(key, df[df['key'] == key].sum())

A key     AAA
data     15
dtype: object
B key     BBB
data     30
dtype: object
C key     CCC
data     45
dtype: object

In [96]:
df.groupby('key').sum()

     data
key
A      15
B      30
C      45

In [97]:
df.groupby('key').aggregate(np.sum)

     data
key
A      15
B      30
C      45

In [98]:
df.groupby('key').mean()

     data
key
A       5
B      10
C      15

In [99]:
df = pd.read_csv(r'D:\01_Arbeit\02_Studierung\13 数字化学习\01 网课\01 学习笔记\02 Python基础\01 py_file\data\train.csv')

In [100]:
df.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [101]:
df.groupby('Sex')['Survived'].sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

In [102]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                  'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                  'C': np.random.randn(8),
                  'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.624318 -1.847486
1  bar    one -0.431358  1.785692
2  foo    two -0.899602  0.140781
3  bar  three -1.541860  1.441239
4  foo    two -0.202569 -2.073728
5  bar    two  0.197686  1.861615
6  foo    one  0.282283  1.512736
7  foo  three  0.365257 -0.491730

In [105]:
grouped = df.groupby('A')
grouped.count()

     B  C  D
A
bar  3  3  3
foo  5  5  5

In [106]:
grouped = df.groupby(['A', 'B'])
grouped.count()

           C  D
A   B
bar one    1  1
    three  1  1
    two    1  1
foo one    2  2
    three  1  1
    two    2  2

In [110]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'a'
    else:
        return 'b'
grouped = df.groupby(get_letter_type, axis=1)
grouped.count().iloc[0]

a    1
b    3
Name: 0, dtype: int64

In [116]:
s = pd.Series([1,2,3,1,2,3], [7,6,5,7,6,5])
s

7    1
6    2
5    3
7    1
6    2
5    3
dtype: int64

In [117]:
grouped = s.groupby(level=0)

In [118]:
grouped.first()

5    3
6    2
7    1
dtype: int64

In [119]:
grouped.last()

5    3
6    2
7    1
dtype: int64

In [120]:
grouped.sum()

5    6
6    4
7    2
dtype: int64

In [121]:
grouped = s.groupby(level=0, sort=False)

In [122]:
grouped.first()

7    1
6    2
5    3
dtype: int64

In [123]:
df2 = pd.DataFrame({'X': ['A', 'B', 'A', 'B'],
                   'Y': [1, 2, 3, 4]})
df2

   X  Y
0  A  1
1  B  2
2  A  3
3  B  4

In [124]:
df2.groupby(['X']).get_group('A')

   X  Y
0  A  1
2  A  3

In [125]:
df2.groupby(['X']).get_group('B')

   X  Y
1  B  2
3  B  4

In [126]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
         ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [127]:
index = pd.MultiIndex.from_arrays(arrays, names=['first', 'second'])

In [129]:
s = pd.Series(np.random.randn(8), index=index)
s

first  second
bar    one       0.310699
       two      -1.078043
baz    one       0.876962
       two      -1.259393
foo    one      -0.445741
       two      -0.580703
qux    one       0.692496
       two       0.270344
dtype: float64

In [130]:
grouped = s.groupby(level=0)
grouped.sum()

first
bar   -0.767344
baz   -0.382431
foo   -1.026445
qux    0.962839
dtype: float64

In [131]:
grouped = s.groupby(level=1)
grouped.sum()

second
one    1.434415
two   -2.647796
dtype: float64

In [132]:
grouped = s.groupby(level='first')
grouped.sum()

first
bar   -0.767344
baz   -0.382431
foo   -1.026445
qux    0.962839
dtype: float64

In [133]:
grouped = s.groupby(level='second')
grouped.sum()

second
one    1.434415
two   -2.647796
dtype: float64

In [136]:
grouped = df.groupby(['A', 'B'])
grouped.aggregate(np.sum)

                  C         D
A   B
bar one   -0.431358  1.785692
    three -1.541860  1.441239
    two    0.197686  1.861615
foo one   -0.342036 -0.334750
    three  0.365257 -0.491730
    two   -1.102171 -1.932947

In [137]:
grouped = df.groupby(['A', 'B'], as_index=False)
grouped.aggregate(np.sum)

     A      B         C         D
0  bar    one -0.431358  1.785692
1  bar  three -1.541860  1.441239
2  bar    two  0.197686  1.861615
3  foo    one -0.342036 -0.334750
4  foo  three  0.365257 -0.491730
5  foo    two -1.102171 -1.932947

In [139]:
df.groupby(['A', 'B']).sum().reset_index()

     A      B         C         D
0  bar    one -0.431358  1.785692
1  bar  three -1.541860  1.441239
2  bar    two  0.197686  1.861615
3  foo    one -0.342036 -0.334750
4  foo  three  0.365257 -0.491730
5  foo    two -1.102171 -1.932947

In [141]:
grouped = df.groupby(['A', 'B'])
grouped.size()

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

In [142]:
grouped.describe().head()

              C                                                              \
          count      mean       std       min       25%       50%       75%
A   B
bar one     1.0 -0.431358       NaN -0.431358 -0.431358 -0.431358 -0.431358
    three   1.0 -1.541860       NaN -1.541860 -1.541860 -1.541860 -1.541860
    two     1.0  0.197686       NaN  0.197686  0.197686  0.197686  0.197686
foo one     2.0 -0.171018  0.641064 -0.624318 -0.397668 -0.171018  0.055633
    three   1.0  0.365257       NaN  0.365257  0.365257  0.365257  0.365257

                        D                                                    \
                max count      mean       std       min       25%       50%
A   B
bar one   -0.431358   1.0  1.785692       NaN  1.785692  1.785692  1.785692
    three -1.541860   1.0  1.441239       NaN  1.441239  1.441239  1.441239
    two    0.197686   1.0  1.861615       NaN  1.861615  1.861615  1.861615
foo one    0.282283   2.0 -0.167375  2.376035 -1.847486 -1.007430 -0.167375
    three  0.365257   1.0 -0.491730       NaN -0.491730 -0.491730 -0.491730


                75%       max
A   B
bar one    1.785692  1.785692
    three  1.441239  1.441239
    two    1.861615  1.861615
foo one    0.672680  1.512736
    three -0.491730 -0.491730

In [156]:
grouped = df.groupby('A')
grouped['C'].agg([np.sum, np.mean, np.std])

          sum      mean       std
A
bar -1.775532 -0.591844  0.880807
foo -1.078949 -0.215790  0.552350

In [161]:
grouped['C'].agg([('res_sum', np.sum), ('res_mean', np.mean), ('res_std', np.std)])

      res_sum  res_mean   res_std
A
bar -1.775532 -0.591844  0.880807
foo -1.078949 -0.215790  0.552350

### 数值运算操作

In [162]:
df = pd.DataFrame([[1,2,3], [4,5,6]], index=['a', 'b'], columns=['A', 'B', 'C'])
df

   A  B  C
a  1  2  3
b  4  5  6

In [163]:
df.sum()

A    5
B    7
C    9
dtype: int64

In [164]:
df.sum(axis=0)

A    5
B    7
C    9
dtype: int64

In [165]:
df.sum(axis=1)

a     6
b    15
dtype: int64

In [166]:
df.sum(axis='rows')

A    5
B    7
C    9
dtype: int64

In [167]:
df

   A  B  C
a  1  2  3
b  4  5  6

In [168]:
df.sum(axis='columns')

a     6
b    15
dtype: int64

In [169]:
df.mean()

A    2.5
B    3.5
C    4.5
dtype: float64

In [170]:
df.mean(axis='columns')

a    2.0
b    5.0
dtype: float64

In [171]:
df.min()

A    1
B    2
C    3
dtype: int64

In [172]:
df.max()

A    4
B    5
C    6
dtype: int64

In [173]:
df.median()

A    2.5
B    3.5
C    4.5
dtype: float64

### 二元统计

In [175]:
df = pd.read_csv(r'D:\01_Arbeit\02_Studierung\13 数字化学习\01 网课\01 学习笔记\02 Python基础\01 py_file\data\train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [176]:
df.cov()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,66231.000000,-0.626966,-7.561798,138.696504,-16.325843,-0.342697,161.883369
Survived,-0.626966,0.236772,-0.137703,-0.551296,-0.018954,0.032017,6.221787
Pclass,-7.561798,-0.137703,0.699015,-4.496004,0.076599,0.012429,-22.830196
Age,138.696504,-0.551296,-4.496004,211.019125,-4.163334,-2.344191,73.849030
SibSp,-16.325843,-0.018954,0.076599,-4.163334,1.216043,0.368739,8.748734
Parch,-0.342697,0.032017,0.012429,-2.344191,0.368739,0.649728,8.661052
Fare,161.883369,6.221787,-22.830196,73.849030,8.748734,8.661052,2469.436846

In [177]:
df.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [179]:
df['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

In [180]:
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [184]:
df.groupby('Pclass')['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [188]:
df['Age'].value_counts(ascending=True, bins=3)

(53.473, 80.0]       50
(0.339, 26.947]     319
(26.947, 53.473]    345
Name: Age, dtype: int64

In [189]:
df['Age'].count()

714

In [190]:
df['Pclass'].count()

891

In [191]:
print(help(pd.value_counts))

Help on function value_counts in module pandas.core.algorithms:

value_counts(values, sort:bool=True, ascending:bool=False, normalize:bool=False, bins=None, dropna:bool=True) -> 'Series'
    Compute a histogram of the counts of non-null values.

    Parameters
    ----------
    values : ndarray (1-d)
    sort : bool, default True
        Sort by values
    ascending : bool, default False
        Sort in ascending order
    normalize: bool, default False
        If True then compute a relative histogram
    bins : integer, optional
        Rather than count values, group them into half-open bins,
        convenience for pd.cut, only works with numeric data
    dropna : bool, default True
        Don't include counts of NaN

    Returns
    -------
    Series

None

### 对象的增删改查

### Series结构的增删改查

In [2]:
import pandas as pd
data = [10, 11, 12]
index = ['a', 'b', 'c']
s = pd.Series(data=data, index=index)
s

a    10
b    11
c    12
dtype: int64

### 查

In [3]:
s[0]

10

In [4]:
s[:2]

a    10
b    11
dtype: int64

In [5]:
mask = [True, False, True]
s[mask]

a    10
c    12
dtype: int64

In [6]:
s.loc['a':'c']

a    10
b    11
c    12
dtype: int64

In [7]:
s.iloc[:2]

a    10
b    11
dtype: int64

### 改

In [14]:
s1 = s.copy()
s1['a'] = 100
s1

a    100
b     11
c     12
dtype: int64

In [30]:
s1.replace(to_replace=100, value=101, inplace=False)

a    101
b     11
c     12
dtype: int64

In [31]:
s1

a    100
b     11
c     12
dtype: int64

In [33]:
s1.index

Index(['a', 'b', 'c'], dtype='object')

In [39]:
s1.index = ['3', '1', '2']

In [40]:
s1

3    100
1     11
2     12
dtype: int64

In [41]:
s1.rename(index={'3': 'A'}, inplace=True)
s1

A    100
1     11
2     12
dtype: int64

### 增

In [42]:
s2 = pd.Series(data=[100, 110], index=['h', 'k'])
s2

h    100
k    110
dtype: int64

In [44]:
s3 = s1.append(s2)
s3

A    100
1     11
2     12
h    100
k    110
dtype: int64

In [45]:
s3['j'] = 500
s3

A    100
1     11
2     12
h    100
k    110
j    500
dtype: int64

In [46]:
s1.append(s2, ignore_index=True)

0    100
1     11
2     12
3    100
4    110
dtype: int64

### 删

In [49]:
s3

1     11
2     12
h    100
k    110
j    500
dtype: int64

In [50]:
# 删一个
del s3['1']
s3

2     12
h    100
k    110
j    500
dtype: int64

In [53]:
# 删多个
s3.drop(['2', 'h'], inplace=True)
s3

k    110
j    500
dtype: int64

### DataFrame结构的增删改查

In [54]:
d1 = [[1,2,3], [4,5,6]]
i1 = ['a', 'b']
c1 = ['A', 'B', 'C']
df1 = pd.DataFrame(data=d1, index=i1, columns=c1)
df1

   A  B  C
a  1  2  3
b  4  5  6

### DataFrame查

### DataFrame查列

In [56]:
df1['A']

a    1
b    4
Name: A, dtype: int64

### DataFrame查行

In [63]:
df1.iloc[0]

A    1
B    2
C    3
Name: a, dtype: int64

In [64]:
df1.loc['a']

A    1
B    2
C    3
Name: a, dtype: int64

### DataFrame改

In [66]:
df1.loc['a']['A'] = 100
df1

     A  B  C
a  100  2  3
b    4  5  6

In [69]:
df1.index = ['h', 'k']
df1

     A  B  C
h  100  2  3
k    4  5  6

In [71]:
df1.rename(index={'h': 'D'}, inplace=True)
df1

     A  B  C
D  100  2  3
k    4  5  6

### 增

### 增加一行

In [73]:
df1.loc['c'] = [1,2,3]
df1

     A  B  C
D  100  2  3
k    4  5  6
c    1  2  3

In [74]:
data = [[1,2,3], [4,5,6]]
index = ['a', 'b']
columns = ['A', 'B', 'C']

df2 = pd.DataFrame(data=data, index=index, columns=columns)
df2

   A  B  C
a  1  2  3
b  4  5  6

### 增加多行

In [79]:
df3 = pd.concat([df1, df2], axis=0)
df3

     A  B  C
D  100  2  3
k    4  5  6
c    1  2  3
a    1  2  3
b    4  5  6

### 增加一列

In [80]:
df2['Tang'] = [10, 11]
df2

   A  B  C  Tang
a  1  2  3    10
b  4  5  6    11

### 增加多列

In [86]:
df4 = pd.DataFrame([[10,11],[12,13]], index=['a', 'b'], columns=['D', 'E'])
df4

    D   E
a  10  11
b  12  13

In [88]:
df5 = pd.concat([df2,df4], axis=1)
df5

   A  B  C  Tang   D   E
a  1  2  3    10  10  11
b  4  5  6    11  12  13

### 删

### 删一行

In [91]:
df5.drop(['a'], axis=0, inplace=True)
df5

   A  B  C  Tang   D   E
b  4  5  6    11  12  13

### 删一列

In [ ]:
del df5['Tang']
df5

### 删多列

In [93]:
df5.drop(['A', 'B', 'C'], axis=1,inplace=True)
df5

    D   E
b  12  13

### merge

In [94]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

In [95]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [96]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [98]:
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [105]:
left = pd.DataFrame({'key1': ['K0', 'K1', 'K2', 'K3'],
                     'key2': ['K0', 'K1', 'K2', 'K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1': ['K0', 'K1', 'K2', 'K3'],
                     'key2': ['K0', 'K1', 'K2', 'K4'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

In [106]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K1   K1  A1  B1
2   K2   K2  A2  B2
3   K3   K3  A3  B3

In [107]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K1  C1  D1
2   K2   K2  C2  D2
3   K3   K4  C3  D3

In [108]:
pd.merge(left, right, on='key1')

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K1     K1  A1  B1     K1  C1  D1
2   K2     K2  A2  B2     K2  C2  D2
3   K3     K3  A3  B3     K4  C3  D3

### 交集

In [109]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K1  A1  B1  C1  D1
2   K2   K2  A2  B2  C2  D2

### 并集

In [110]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K1   K1   A1   B1   C1   D1
2   K2   K2   A2   B2   C2   D2
3   K3   K3   A3   B3  NaN  NaN
4   K3   K4  NaN  NaN   C3   D3

In [111]:
pd.merge(left, right, on=['key1', 'key2'], how='outer', indicator=True)

  key1 key2    A    B    C    D      _merge
0   K0   K0   A0   B0   C0   D0        both
1   K1   K1   A1   B1   C1   D1        both
2   K2   K2   A2   B2   C2   D2        both
3   K3   K3   A3   B3  NaN  NaN   left_only
4   K3   K4  NaN  NaN   C3   D3  right_only

In [112]:
pd.merge(left, right, on=['key1', 'key2'], how='left')

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K1   K1  A1  B1   C1   D1
2   K2   K2  A2  B2   C2   D2
3   K3   K3  A3  B3  NaN  NaN

In [113]:
pd.merge(left, right, on=['key1', 'key2'], how='right')

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K1   A1   B1  C1  D1
2   K2   K2   A2   B2  C2  D2
3   K3   K4  NaN  NaN  C3  D3

### Pandas的显示设置

In [114]:
pd.get_option('display.max_rows')

60

In [122]:
pd.set_option('display.max_rows', 60)

In [123]:
pd.Series(index = range(100))

C:\Users\mabin\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
      ..
95   NaN
96   NaN
97   NaN
98   NaN
99   NaN
Length: 100, dtype: float64

In [124]:
pd.get_option('display.max_columns')

20

In [125]:
pd.DataFrame(columns=range(30))

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29]
Index: []

[0 rows x 30 columns]

In [128]:
pd.set_option('display.max_columns', 20)

In [129]:
pd.DataFrame(columns=range(30))

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29]
Index: []

[0 rows x 30 columns]

In [130]:
pd.get_option('display.max_colwidth')

50

In [131]:
pd.Series(index= ['A'], data=['t'*70])

A    tttttttttttttttttttttttttttttttttttttttttttttt...
dtype: object

In [132]:
pd.set_option('display.max_colwidth', 100)

In [133]:
pd.Series(index= ['A'], data=['t'*70])

A    tttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttt
dtype: object

In [134]:
pd.get_option('display.precision')

6

In [136]:
pd.Series(data=[1.345678909876543])

0    1.345679
dtype: float64

In [140]:
pd.set_option('display.precision', 6)

In [141]:
pd.Series(data=[1.345678909876543])

0    1.345679
dtype: float64

### 数据透视表

In [144]:
example = pd.DataFrame({'Month': ['January', 'January', 'January', 'January',
                                    'February', 'February', 'February', 'February',
                                    'March', 'March', 'March', 'March'],
                          'Category': ['Transprortation', 'Grocery', 'Household', 'Entertainment',
                                      'Transprortation', 'Grocery', 'Household', 'Entertainment',
                                      'Transprortation', 'Grocery', 'Household', 'Entertainment'],
                          'Amount': [74, 235, 175, 100, 115, 240, 225, 125, 90, 260, 200, 120]})

In [145]:
example

       Month         Category  Amount
0    January  Transprortation      74
1    January          Grocery     235
2    January        Household     175
3    January    Entertainment     100
4   February  Transprortation     115
5   February          Grocery     240
6   February        Household     225
7   February    Entertainment     125
8      March  Transprortation      90
9      March          Grocery     260
10     March        Household     200
11     March    Entertainment     120

In [146]:
example_pivot = example.pivot(index='Category',columns='Month', values='Amount')
example_pivot

Month            February  January  March
Category
Entertainment         125      100    120
Grocery               240      235    260
Household             225      175    200
Transprortation       115       74     90

In [147]:
example_pivot.sum(axis=1)

Category
Entertainment      345
Grocery            735
Household          600
Transprortation    279
dtype: int64

In [149]:
example_pivot.sum(axis=0)

Month
February    705
January     584
March       670
dtype: int64

In [158]:
df = pd.read_csv(r'D:\01_Arbeit\02_Studierung\13 数字化学习\01 网课\01 学习笔记\02 Python基础\01 py_file\data\train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [159]:
# 默认就是求平均值
df.pivot_table(index='Sex', columns='Pclass', values='Fare')

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [156]:
df.pivot_table(index='Sex', columns='Pclass', values='Fare', aggfunc='max')

Pclass         1     2      3
Sex
female  512.3292  65.0  69.55
male    512.3292  73.5  69.55

In [157]:
df.pivot_table(index='Sex', columns='Pclass', values='Fare', aggfunc='count')

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

In [161]:
pd.crosstab(index=df['Sex'], columns=df['Pclass'])

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

In [162]:
df.pivot_table(index='Pclass', columns='Sex', values='Survived', aggfunc='mean')

Sex       female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

In [163]:
df['Underaged'] = df['Age'] <= 18

In [164]:
df.pivot_table(index='Underaged', columns='Sex', values='Survived', aggfunc='mean')

Sex          female      male
Underaged
False      0.760163  0.167984
True       0.676471  0.338028

### 时间操作

In [220]:
%matplotlib notebook
import datetime

In [166]:
dt = datetime.datetime(year=2020, month=11, day=8, hour=16, minute=57)
dt

datetime.datetime(2020, 11, 8, 16, 57)

In [167]:
print(dt)

2020-11-08 16:57:00

In [168]:
ts = pd.Timestamp('2020-11-08')
ts

Timestamp('2020-11-08 00:00:00')

In [169]:
ts.month

11

In [170]:
ts.day

8

In [171]:
ts + pd.Timedelta('5 days')

Timestamp('2020-11-13 00:00:00')

In [172]:
pd.to_datetime('2020-11-08')

Timestamp('2020-11-08 00:00:00')

In [173]:
pd.to_datetime('08/11/2020')

Timestamp('2020-08-11 00:00:00')

In [175]:
s = pd.Series(['2020-08-11 00:00:00', '2020-08-12 00:00:00', '2020-08-13 00:00:00'])
s

0    2020-08-11 00:00:00
1    2020-08-12 00:00:00
2    2020-08-13 00:00:00
dtype: object

In [176]:
ts = pd.to_datetime(s)
ts

0   2020-08-11
1   2020-08-12
2   2020-08-13
dtype: datetime64[ns]

In [177]:
ts.dt.hour

0    0
1    0
2    0
dtype: int64

In [178]:
ts.dt.weekday

0    1
1    2
2    3
dtype: int64

In [180]:
pd.Series(pd.date_range(start='2020-11-8', periods=10, freq='12H'))

0   2020-11-08 00:00:00
1   2020-11-08 12:00:00
2   2020-11-09 00:00:00
3   2020-11-09 12:00:00
4   2020-11-10 00:00:00
5   2020-11-10 12:00:00
6   2020-11-11 00:00:00
7   2020-11-11 12:00:00
8   2020-11-12 00:00:00
9   2020-11-12 12:00:00
dtype: datetime64[ns]

In [182]:
data = pd.read_csv(r'D:\01_Arbeit\02_Studierung\13 数字化学习\01 网课\01 学习笔记\02 Python基础\01 py_file\data\flowdata.csv')

In [183]:
data.head()

              Time    L0_347    L0_348     L0_349
0   7/10/2020 2:31  5.385722  9.376434  10.438684
1  11/19/2018 0:55  4.307191  8.826062   5.334293
2  12/18/2019 2:46  7.764640  9.001400   6.952488
3  1/29/2019 20:39  4.013024  4.801515   2.674157
4  6/29/2019 10:10  8.062857  6.064085   3.657821

In [184]:
data['Time'] = pd.to_datetime(data['Time'])
data = data.set_index('Time')
data

                        L0_347     L0_348     L0_349
Time
2020-07-10 02:31:00   5.385722   9.376434  10.438684
2018-11-19 00:55:00   4.307191   8.826062   5.334293
2019-12-18 02:46:00   7.764640   9.001400   6.952488
2019-01-29 20:39:00   4.013024   4.801515   2.674157
2019-06-29 10:10:00   8.062857   6.064085   3.657821
...                        ...        ...        ...
2019-02-19 17:02:00  10.681259   8.191395   9.946697
2018-02-22 03:31:00   4.502884   3.797456   9.243524
2018-05-01 14:18:00   2.180071  10.955888   4.972102
2019-08-03 00:08:00   2.429045   7.550062   5.657811
2018-04-23 17:24:00   8.320621   8.038058   1.713229

[999 rows x 3 columns]

In [185]:
data.index

DatetimeIndex(['2020-07-10 02:31:00', '2018-11-19 00:55:00',
               '2019-12-18 02:46:00', '2019-01-29 20:39:00',
               '2019-06-29 10:10:00', '2018-03-25 15:30:00',
               '2020-04-19 00:15:00', '2019-07-04 16:47:00',
               '2020-09-26 21:17:00', '2018-11-02 05:04:00',
               ...
               '2018-06-09 01:02:00', '2019-11-01 00:43:00',
               '2019-11-21 20:47:00', '2020-07-17 03:13:00',
               '2018-10-16 22:20:00', '2019-02-19 17:02:00',
               '2018-02-22 03:31:00', '2018-05-01 14:18:00',
               '2019-08-03 00:08:00', '2018-04-23 17:24:00'],
              dtype='datetime64[ns]', name='Time', length=999, freq=None)

In [196]:
data = pd.read_csv(r'D:\01_Arbeit\02_Studierung\13 数字化学习\01 网课\01 学习笔记\02 Python基础\01 py_file\data\flowdata.csv', index_col = 0, parse_dates = True)

In [197]:
data.head()

                       L0_347    L0_348    L0_349
Time
2018-02-14 03:13:00  3.747166  3.249841  1.008382
2018-02-16 16:11:00  7.985840  7.641502  5.792578
2018-02-18 12:58:00  3.159826  7.598091  7.668586
2018-02-19 18:44:00  5.047159  7.828444  7.514631
2018-02-20 15:52:00  4.218379  9.322511  9.210770

In [200]:
data[pd.Timestamp('2018-11-19 00:00:00'):pd.Timestamp('2018-11-22 17:00:00')]

                       L0_347    L0_348    L0_349
Time
2018-11-19 00:55:00  4.307191  8.826062  5.334293
2018-11-20 05:09:00  1.414435  9.776239  8.487048
2018-11-21 11:45:00  6.993036  7.302307  5.681003
2018-11-22 02:05:00  6.738676  7.639117  5.490065
2018-11-22 11:13:00  9.584373  4.163386  3.405744

In [201]:
data[('2018-11-19 00:00:00'):('2018-11-22 17:00:00')]

                       L0_347    L0_348    L0_349
Time
2018-11-19 00:55:00  4.307191  8.826062  5.334293
2018-11-20 05:09:00  1.414435  9.776239  8.487048
2018-11-21 11:45:00  6.993036  7.302307  5.681003
2018-11-22 02:05:00  6.738676  7.639117  5.490065
2018-11-22 11:13:00  9.584373  4.163386  3.405744

In [202]:
data.tail()

                       L0_347    L0_348    L0_349
Time
2020-11-05 12:27:00  7.920954  2.578554  9.136739
2020-11-06 08:55:00  3.882261  3.301039  6.497255
2020-11-07 09:02:00  7.328595  9.685938  8.450516
2020-11-07 11:00:00  8.196502  7.581670  3.288706
2020-11-07 20:50:00  5.210425  9.961751  1.658113

In [206]:
data['2018']

                       L0_347     L0_348    L0_349
Time
2018-02-14 03:13:00  3.747166   3.249841  1.008382
2018-02-16 16:11:00  7.985840   7.641502  5.792578
2018-02-18 12:58:00  3.159826   7.598091  7.668586
2018-02-19 18:44:00  5.047159   7.828444  7.514631
2018-02-20 15:52:00  4.218379   9.322511  9.210770
...                       ...        ...       ...
2018-12-29 10:47:00  9.502539   4.976209  2.375926
2018-12-29 11:58:00  8.669948   9.284043  9.750466
2018-12-30 07:14:00  2.902482   8.622184  2.560309
2018-12-30 15:55:00  8.235131  10.008085  3.337510
2018-12-31 23:29:00  9.880913   3.305342  8.444124

[330 rows x 3 columns]

In [207]:
data['2018-06':'2018-12']

                       L0_347     L0_348    L0_349
Time
2018-06-01 20:35:00  7.888237   3.591661  1.994734
2018-06-03 07:21:00  2.038472   6.022082  9.632639
2018-06-05 01:26:00  7.195080   8.549613  6.399375
2018-06-05 16:20:00  9.320800   6.185821  1.846711
2018-06-06 05:14:00  9.654534   5.681249  9.931814
...                       ...        ...       ...
2018-12-29 10:47:00  9.502539   4.976209  2.375926
2018-12-29 11:58:00  8.669948   9.284043  9.750466
2018-12-30 07:14:00  2.902482   8.622184  2.560309
2018-12-30 15:55:00  8.235131  10.008085  3.337510
2018-12-31 23:29:00  9.880913   3.305342  8.444124

[224 rows x 3 columns]

In [208]:
data[data.index.month==12]

                        L0_347    L0_348    L0_349
Time
2018-12-01 17:52:00   5.710448  4.889754  9.071036
2018-12-03 09:34:00   1.896400  8.028741  3.459994
2018-12-06 19:10:00   1.264533  7.985702  1.865635
2018-12-08 08:12:00  10.308142  3.226722  8.883657
2018-12-08 19:04:00   5.377241  1.156238  1.472244
...                        ...       ...       ...
2019-12-27 02:55:00  10.295776  1.884896  7.379825
2019-12-27 08:59:00   8.860444  3.777357  8.728270
2019-12-27 11:58:00   4.103062  3.767236  5.771515
2019-12-30 17:07:00   3.844073  4.337684  6.275115
2019-12-31 12:00:00  10.974256  2.385787  8.301782

[76 rows x 3 columns]

In [209]:
data[(data.index.hour > 8) & (data.index.hour < 12)]

                        L0_347    L0_348     L0_349
Time
2018-03-02 10:45:00   3.541963  2.775624   2.445506
2018-03-04 11:27:00  10.446706  9.574938  10.028655
2018-03-05 09:43:00   4.435921  1.036423   2.449988
2018-03-08 09:32:00   1.963659  1.615221   7.535765
2018-03-19 10:19:00  10.722043  4.143649   3.903194
...                        ...       ...        ...
2020-10-21 10:11:00   5.798999  6.991242  10.829230
2020-10-23 09:02:00   2.949965  8.443377   5.086051
2020-10-26 09:43:00   8.502004  8.775339   1.136041
2020-11-07 09:02:00   7.328595  9.685938   8.450516
2020-11-07 11:00:00   8.196502  7.581670   3.288706

[136 rows x 3 columns]

In [210]:
data.between_time('08:00', '12:00')

                        L0_347    L0_348     L0_349
Time
2018-02-24 08:33:00   5.101435  2.151699   4.622253
2018-03-02 10:45:00   3.541963  2.775624   2.445506
2018-03-04 11:27:00  10.446706  9.574938  10.028655
2018-03-05 09:43:00   4.435921  1.036423   2.449988
2018-03-08 09:32:00   1.963659  1.615221   7.535765
...                        ...       ...        ...
2020-10-23 09:02:00   2.949965  8.443377   5.086051
2020-10-26 09:43:00   8.502004  8.775339   1.136041
2020-11-06 08:55:00   3.882261  3.301039   6.497255
2020-11-07 09:02:00   7.328595  9.685938   8.450516
2020-11-07 11:00:00   8.196502  7.581670   3.288706

[183 rows x 3 columns]

In [211]:
data.head()

                       L0_347    L0_348    L0_349
Time
2018-02-14 03:13:00  3.747166  3.249841  1.008382
2018-02-16 16:11:00  7.985840  7.641502  5.792578
2018-02-18 12:58:00  3.159826  7.598091  7.668586
2018-02-19 18:44:00  5.047159  7.828444  7.514631
2018-02-20 15:52:00  4.218379  9.322511  9.210770

In [212]:
data.resample('D').mean().head()

              L0_347    L0_348    L0_349
Time
2018-02-14  3.747166  3.249841  1.008382
2018-02-15       NaN       NaN       NaN
2018-02-16  7.985840  7.641502  5.792578
2018-02-17       NaN       NaN       NaN
2018-02-18  3.159826  7.598091  7.668586

In [214]:
data.resample('D').max().head()

              L0_347    L0_348    L0_349
Time
2018-02-14  3.747166  3.249841  1.008382
2018-02-15       NaN       NaN       NaN
2018-02-16  7.985840  7.641502  5.792578
2018-02-17       NaN       NaN       NaN
2018-02-18  3.159826  7.598091  7.668586

In [215]:
data.resample('3D').mean().head()

              L0_347    L0_348    L0_349
Time
2018-02-14  5.866503  5.445671  3.400480
2018-02-17  4.103493  7.713268  7.591608
2018-02-20  4.360631  6.559984  9.227147
2018-02-23  7.274261  3.543793  4.557330
2018-02-26  7.805490  3.857731  5.463116